constant/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-2 -1.5 0)
    ( 4 -1.5 0)
    ( 4  1.5 0)
    (-2  1.5 0)
    (-2 -1.5 0.1)
    ( 4 -1.5 0.1)
    ( 4  1.5 0.1)
    (-2  1.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upstream 
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    downstream 
    {
        type patch;
        faces
        (
		  	   (1 2 6 5)
        );
    }
    upANDdown 
    {
        type patch; 
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
	 frontANDback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
