constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.002/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upstream
    {
        type            patch;
        nFaces          30;
        startFace       3330;
    }
    downstream
    {
        type            patch;
        nFaces          30;
        startFace       3360;
    }
    upANDdown
    {
        type            patch;
        nFaces          120;
        startFace       3390;
    }
    frontANDback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3440;
        startFace       3510;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       6950;
    }
)

// ************************************************************************* //
