0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	upstream
	{
		type 		fixedValue;
		value 	0;
	}
	downstream
	{
		type 		fixedValue;
		value 	0;
	}
	upANDdown
	{
		type 		fixedValue;
		value 	0;
	}
	frontANDback
	{
		type 		empty;
	}
	cylinder
	{
		type 		zeroGradient;
	}
}

// ************************************************************************* //
